# Найдите произведение цифр трехзначного числа.
n = int(input('Введите трехзначное число: '))

'''
653
653 / 100 = 6.53 (отрезать дробную часть //)
tmp = 653 % 100 = 53 
tmp / 10 = 5.3 (отрезать дробную часть)
tmp % 10 = 3
'''
hundreds = n // 100
tmp = n % 100
tens = tmp // 10
units = tmp % 10

print(f'{hundreds} * {tens} * {units} = {hundreds * tens * units}')
